{
  "Barbarian": {
    "equipment": [
      "",
      "",
      ""
    ],
    "features": {
      "firstLevel": [
        {
          "name": "Unarmored Defense",
          "description": "While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit.",
          "level": 1
        },
        {
          "name": "Rage",
          "description": "In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action. (ET AL)",
          "level": 1
        }
      ],
      "secondLevel": [
        {
          "name": "Reckless Attack",
          "description": "Starting at second level, you can throw aside all concern for defense and attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage against you until next turn. ",
          "level": 2
        },
        {
          "name": "Danger Sense",
          "description": "At second level, you gain an uncanny sense of when things nearby aren't as they should be, giving you an edge when you dodge away from danger. You have advantage on Dexterity saving throws against effects you can see, such as traps and spells. To gain this benefit, you can't be blinded, deafened, or incapacitated.",
          "level": 2
        }
      ],
      "thirdLevel": [
        {
          "name": "Primal Path (Archetype Choice)",
          "description": "At third level, you choose a path that shapes the nature of your rage. Choose the Path of the Berserker or the Path of the Totem Warrior, both detailed below. Your choice grants you features at 3rd level and again at 6th, 10th, and 14th levels.",
          "level": 3
        }
      ],
      "fourthLevel": [
        {
          "name": "Ability Score Improvement",
          "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores by 1. As normal, you can't increase an ability score above 20 using this feature.",
          "level": 4
        }
      ],
      "fifthLevel": [
        {
          "name": "Extra Attack",
          "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.",
          "level": 5
        },
        {
          "name": "Fast Movement",
          "description": "Starting at 5th level, your speed increases by 10 while you are not wearing heavy armor.",
          "level": 5
        }
      ],
      "seventhLevel": [
        {
          "name": "Feral Instinct",
          "description": "By 7th level, your insticts are so honed that you have advantage on initiative rolls. Additionally, if you are surprised at the beginning of combat and aren't incapactitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn.",
          "level": 7
        }
      ],
      "ninethLevel": [
        {
          "name": "Brutal Critical",
          "description": "Beginning at 9th level, you can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee attack. This increases to two additional dice at 13th level and three additional dice at 17th level.",
          "level": 9
        }
      ],
      "eleventhLevel": [
        {
          "name": "Relentless Rage",
          "description": "Starting at 11th level, your rage can keep you fighting despite grievous wounds. If you drop below 0 hit points while you are raging and don't die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead. Each time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10.",
          "level": 11
        }
      ],
      "fifteenthLevel": [
        {
          "name": "Persistent Rage",
          "description": "Beginning at 15th level, your rage becomes so fierce that it ends early only if you fall unconscious or if you choose to end it.",
          "level": 15
        }
      ],
      "eighteenthLevel": [
        {
          "name": "Indomitable Might",
          "description": "Beginning at 18th level, if your total for a Strength check is less than your Strength score, you can use that score in place of the total.",
          "level": 18
        }
      ],
      "twentiethLevel": [
        {
          "name": "Primal Champion",
          "description": "At 20th level, you embody the power of the wilds. Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24.",
          "level": 20
        }
      ]
    },
    "hitDice": "",
    "hitPointsFirstLevel": "",
    "proficiencies": {
      "armor": [
        "",
        "",
        ""
      ],
      "weapons": [
        "",
        "",
        ""
      ],
      "tools": [
        "",
        "",
        ""
      ],
      "savingThrows": [
        "",
        "",
        ""
      ],
      "skills": [
        "",
        "",
        ""
      ]
    }
  },
  "Bard": {
    "equipment": [
      "",
      "",
      ""
    ],
    "features": {
      "firstLevel": [
        {
          "name": "Bardic Inspiration",
          "description": "You can inspire others through stirring words or music. To do so, you use a bonus action on your turn to choose one creature other than yourself within 60 feet of you who can hear you. That creature gains a Bardic Inspiration die, a d6. (ET AL)",
          "level": 1
        }
      ],
      "secondLevel": [
        {
          "name": "Jack of All Trades",
          "description": "Starting at 2nd level, you can add half your proficiency bonus, rounded down, to any ability check you make that doesn't already include your proficiency bonus.",
          "level": 2
        },
        {
          "name": "Song of Rest",
          "description": "Beginning at 2nd level, you can use soothing music or oration to help revitalize your wounded allies during a short rest. If you or any friendly creatures who can hear your performance regain hit points at the end of the short rest by spending one or more Hit Dice, each of those creatures regains an extra 1d6 hit points. The extra hit points increase when you reach certain levels in this class: to 1d8 at 9th level, to 1d10 at 13th level, and to 1d12 at 17th level.",
          "level": 2
        }
      ],
      "thirdLevel": [
        {
          "name": "Bard College (Archetype Choice)",
          "description": "At third level, you delve into the advanced techniques of the bard college of your choice: the College of Lore or the College of Valor, both detailed below. Your choice grants you features at 3rd level and again at 6th and 14th level.",
          "level": 3
        }
      ],
      "fourthLevel": [
        {
          "name": "Ability Score Improvement",
          "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores by 1. As normal, you can't increase an ability score above 20 using this feature.",
          "level": 4
        }
      ],
      "fifthLevel": [
        {
          "name": "Font of Inspiration",
          "description": "Beginning when you reach 5th level, you regain all of your expended uses of Bardic Inspiration when you finish a short or long rest.",
          "level": 5
        }
      ],
      "sixthLevel": [
        {
          "name": "Countercharm",
          "description": "At 6th level, you gain the ability to use musical notes or words of power to disrupt mind-influencing effects. As an action, you can start a performance that lasts until the end of the next turn. During this time, you and any friendly creatures within 30 feet of you have advantage on saving throws against being frightened or charmed. A creature must be able to hear you to gain this benefit. The performance ends early if you are incapacitated or silenced or if you voluntarily end it (no action required).",
          "level": 6
        }
      ],
      "tenthLevel": [
        {
          "name": "Magical Secrets",
          "description": "By 10th level, you have plundered magical knowledge from a wide spectrum of disciplines. Choose two spells from any class, including this one. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip. The chosen spells are considered bard spells for you and are included in the number in the Spells Known column of the Bard table. You learn two additional spells from any class at 14th level and again at 18th level.",
          "level": 10
        }
      ],
      "twentiethLevel": [
        {
          "name": "Superior Inspiration",
          "description": "At 20th level, when you roll initative and have no uses of Bardic Inspiration left, you regain one use.",
          "level": 20
        }
      ]
    },
    "hitDice": "",
    "hitPointsFirstLevel": "",
    "proficiencies": {
      "armor": [
        "",
        "",
        ""
      ],
      "weapons": [
        "",
        "",
        ""
      ],
      "tools": [
        "",
        "",
        ""
      ],
      "savingThrows": [
        "",
        "",
        ""
      ],
      "skills": [
        "",
        "",
        ""
      ]
    }
  },
  "Cleric": {
    "equipment": [
      "",
      "",
      ""
    ],
    "features": {
      "firstLevel": [
        {
          "name": "Divine Domain",
          "description": "Choose one domain related to your deity: Knowledge, Life, Light, Nature, Tempest, Trickery, or War. Each domain is detailed below, and each one has examples of gods associated with it. Your choice grants you domain spells and other features when you choose it at 1st level. It also grants you additional ways to use Channel Divinity when you gain that feature at 2nd level, and additional benefits at 6th, 8th, and 17th levels. (ET AL)",
          "level": 1
        }
      ],
      "secondLevel": [
        {
          "name": "Channel Divinity",
          "description": "At 2nd level, you gain the ability to channel divine energy directly from your deity, using the energy to fuel magical effects. You start with two such effects: Turn Undead and an effect determined by your domain. Some domains grant you additional effects as you advance in levels, as noted in their descriptions. (ET AL)",
          "level": 2
        },
        {
          "name": "Channel Divinity: Turn Undead",
          "description": "As an action, you present your holy symbol and speak a prayer censuring the undead. Each undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its throw, it is turned for 1 minute or until it takes any damage. A turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. It also can't take reactions. For its action, it can only use the Dash action to try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the Dodge action.",
          "level": 2
        }
      ],
      "fourthLevel": [
        {
          "name": "Ability Score Improvement",
          "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores by 1. As normal, you can't increase an ability score above 20 using this feature.",
          "level": 4
        }
      ],
      "fifthLevel": [
        {
          "name": "Destroy Undead",
          "description": "Starting at 5th level, when an undead fails its saving throw against your Turn Undead feature, the creature is instantly destroyed if its challenge rating is at or below a certain threshold, as shown in the Destroy Undead table.",
          "level": 5
        }
      ],
      "tenthLevel": [
        {
          "name": "Divine Intervention",
          "description": "Beginning at 10th level, you can call on your deity to intervene on your behalf when your need is great. Imploring your deity's aid requires you to use your action. Describe the assistance you seek, and roll a percentile dice. If you roll a number at or equal to your cleric level, your diety intervenes. The DM chooses the nature of the intervention; the effect of any cleric spell or cleric domain spell would be appropriate. If your deity intervenes, you cannot use this ability again for 7 days. Otherwise, you can use it again after you finish a long rest. At 20th level, your call for intervention succeeds automatically, no roll required.",
          "level": 10
        }
      ]
    },
    "hitDice": "",
    "hitPointsFirstLevel": "",
    "proficiencies": {
      "armor": [
        "",
        "",
        ""
      ],
      "weapons": [
        "",
        "",
        ""
      ],
      "tools": [
        "",
        "",
        ""
      ],
      "savingThrows": [
        "",
        "",
        ""
      ],
      "skills": [
        "",
        "",
        ""
      ]
    }
  },
  "Druid": {
    "equipment": [
      "",
      "",
      ""
    ],
    "features": {
      "secondLevel": [
        {
          "name": "Wild Shape",
          "description": "Starting at 2nd level, you can use your action to magically assume the shape of a beast that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long rest. Detailed information about this feature can be found below.",
          "level": 2
        },
        {
          "name": "Druid Circle (Archetype Choice)",
          "description": "At 2nd level, you you choose to identify with a circle of druids: the Circle of the Land or the Circle of the Moon, both detailed below. Your choice grants you features at 2nd level and again at 6th, 10th, and 14th level.",
          "level": 2
        }
      ],
      "fourthLevel": [
        {
          "name": "Ability Score Improvement",
          "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores by 1. As normal, you can't increase an ability score above 20 using this feature.",
          "level": 4
        }
      ],
      "eighteenthLevel": [
        {
          "name": "Timeless Body",
          "description": "Starting at 18th level, the primal magic that you weild causes you to age more slowly. For every 10 years that pass, your body ages only 1 year.",
          "level": 18
        },
        {
          "name": "Beast Spells",
          "description": "Beginning at 18th level, you can cast many of your druid spells in any shape you assume using Wild Shape. You can perform the somatic and verbal components of a druid spell while a beast shape, but you aren't able to provide material components.",
          "level": 18
        }
      ],
      "twentiethLevel": [
        {
          "name": "Archdruid",
          "description": "At 20th level, you can use your Wild Shape and unlimited amount of times.",
          "level": 20
        }
      ]
    },
    "hitDice": "",
    "hitPointsFirstLevel": "",
    "proficiencies": {
      "armor": [
        "",
        "",
        ""
      ],
      "weapons": [
        "",
        "",
        ""
      ],
      "tools": [
        "",
        "",
        ""
      ],
      "savingThrows": [
        "",
        "",
        ""
      ],
      "skills": [
        "",
        "",
        ""
      ]
    }
  },
  "Fighter": {
    "equipment": [
      "",
      "",
      ""
    ],
    "features": {
      "firstLevel": [
        {
          "name": "Fighting Style",
          "description": "You adopt a particular style of fighting as your specialty. Choose one of the below options. You can't take a Fighting Style option more than once, even even if you later get to choose again.",
          "level": 1
        },
        {
          "name": "Second Wind",
          "description": "You have a limited well of stamina that you can draw on to protect yourself from harm. On your turn, you can use a bonus action to regain hit points equal to 1d10 + your fighter level. Once you use this feature, you must finish a short or long rest before you can use it again.",
          "level": 1
        }
      ],
      "secondLevel": [
        {
          "name": "Action Surge",
          "description": "Starting at 2nd level, you can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action on top of your regular action and a possible bonus action. Once you use this feature, you must finish a short or long rest before you can use it again. Starting at 17th level, you can use it twice before a rest, but only once per turn.",
          "level": 2
        }
      ],
      "thirdLevel": [
        {
          "name": "Martial Archetype (Archetype Choice)",
          "description": "At 3rd level, you choose an archeytpe that you strive to emulate in your combat styles and techniques. Choose Champion, Battle Master, or Eldritch Knight, all detailed below. The archetype you choose grants you features grants you features at 3rd level and again at 7th, 10th, 15th, and 18th level.",
          "level": 3
        }
      ],
      "fourthLevel": [
          {
            "name": "Ability Score Improvement",
            "description": "When you reach 4th level, and again at 6th, 8th, 12th, 14th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores by 1. As normal, you can't increase an ability score above 20 using this feature.",
            "level": 4
          }
        ],
      "fifthLevel": [
        {
          "name": "Extra Attack",
          "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.",
          "level": 5
        }
      ],
      "ninethLevel": [
        {
          "name": "Indomitable",
          "description": "Beginning at 9th level, you can reroll a saving throw that you fail. If you do so, you must use the new roll, and you can't use this feature again until you finish a long rest. You can use this feature twice between long rests at 13th level and three times between long rests starting at 17th level.",
          "level": 9
        }
      ]
    },
    "hitDice": "",
    "hitPointsFirstLevel": "",
    "proficiencies": {
      "armor": [
        "",
        "",
        ""
      ],
      "weapons": [
        "",
        "",
        ""
      ],
      "tools": [
        "",
        "",
        ""
      ],
      "savingThrows": [
        "",
        "",
        ""
      ],
      "skills": [
        "",
        "",
        ""
      ]
    }
  },
  "Monk": {
    "equipment": [
      "",
      "",
      ""
    ],
    "features": {
      "firstLevel": [
        {
          "name": "Unarmored Defense",
          "description": "Beginning at 1st level, while you are wearing no armor and not wielding a shield, your AC equals 10 + your Dexterity modifier + your Wisdom modifier. ",
          "level": 1
        },
        {
          "name": "Martial Arts",
          "description": "At 1st level, your practice of martial arts gives you mastery of combat styles that use unarmed strikes and monk weapons, which are shortswords and any simple melee weapons that don't have the two-handed or heavy property. (ET AL)",
          "level": 1
        }
      ],
      "secondLevel": [
        {
          "name": "Ki",
          "description": "Starting at 2nd level, you can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action on top of your regular action and a possible bonus action. Once you use this feature, you must finish a short or long rest before you can use it again. Starting at 17th level, you can use it twice before a rest, but only once per turn.",
          "level": 2
        }
      ],
      "thirdLevel": [
        {
          "name": "Martial Archetype (Archetype Choice)",
          "description": "At 3rd level, you choose an archeytpe that you strive to emulate in your combat styles and techniques. Choose Champion, Battle Master, or Eldritch Knight, all detailed below. The archetype you choose grants you features grants you features at 3rd level and again at 7th, 10th, 15th, and 18th level.",
          "level": 3
        }
      ],
      "fourthLevel": [
          {
            "name": "Ability Score Improvement",
            "description": "When you reach 4th level, and again at 6th, 8th, 12th, 14th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores by 1. As normal, you can't increase an ability score above 20 using this feature.",
            "level": 4
          }
        ],
      "fifthLevel": [
        {
          "name": "Extra Attack",
          "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.",
          "level": 5
        }
      ],
      "ninethLevel": [
        {
          "name": "Indomitable",
          "description": "Beginning at 9th level, you can reroll a saving throw that you fail. If you do so, you must use the new roll, and you can't use this feature again until you finish a long rest. You can use this feature twice between long rests at 13th level and three times between long rests starting at 17th level.",
          "level": 9
        }
      ]
    },
    "hitDice": "",
    "hitPointsFirstLevel": "",
    "proficiencies": {
      "armor": [
        "",
        "",
        ""
      ],
      "weapons": [
        "",
        "",
        ""
      ],
      "tools": [
        "",
        "",
        ""
      ],
      "savingThrows": [
        "",
        "",
        ""
      ],
      "skills": [
        "",
        "",
        ""
      ]
    }
  },
  "Paladin": {
    "equipment": [
      "",
      "",
      ""
    ],
    "features": {
      "firstLevel": [
        {
          "name": "Divine Sense",
          "description": "The presence of strong evil registers on your senses like a noxious odor, and powerful good rings like heavenly music in your ears. As an action, you can open your awareness to direct such forces. Until the end of your next turn, you know the location of any celestial, fiend, or undead within 60 feet of you that is not behind total cover. You know the type (celestial, fiend, or undead) of any being whose presence you sense, but not its identity. Within the same radius, you also detect the presence of any place or object that has been consecrated or desecrated, as with the hallow spell.",
          "level": 1
        },
        {
          "name": "Lay on Hands",
          "description": "Your blessed touch can heal wounds. You have a pool of healing power that replenishes when you take a long rest. With that pool, you can restore a total number of hitpoints equal to your paladin level x 5. As an action, you can touch a creature and draw power from the pool to restore a number of hit points to that creature, up to the maximum amount remaining in your pool. Alternatively, you can expend 5 hit points from your pool of healing to cure the target of one disease or neutralize one poison affecting it. You can cure multiple diseases or neutralize multiple poisons with a single use of Lay on Hands, expending hit points separately for each one. This feature has no effect on undead or constructs.",
          "level": 1
        }
      ],
      "secondLevel": [
        {
          "name": "Fighting Style",
          "description": "At 2nd level, you adopt a style of fighting as your specialty. Choose one of the below options. You can't take a fighting style more than once, even if you later get to choose again.",
          "level": 2
        },
        {
          "name": "Divine Smite",
          "description": "Starting at 2nd level, when you hti a creature with a melee weapon attack, you can expend one spell slot to deal radiant damage to the target to the target, in addition to the weapon's damage. The extra damage is 2d8 for a 1st-level spell slot, plus 1d8 for each spell level higher than 1st, to a maximum of 5d8. The damage incrases by 1d8 if the target is an undead or a fiend.",
          "level": 2
        }
      ],
      "thirdLevel": [
        {
          "name": "Divine Health",
          "description": "By 3rd level, the divine magic flowing through you makes you immune to disease.",
          "level": 3
        },
        {
          "name": "Sacred Oath (Archetype Choice)",
          "description": "When you reach 3rd level, you swear the oath that binds you as a paladin forever. Up to this time you have been in a preparatory stage, commited to the path but not yet sworn to it. Now you choose the Oath of Devotion, the Oath of the Ancients, or the Oath of Vengence, all detailed below. Your choice grants you features at 3rd level and again at 7th, 15th, and 20th level. Those features include oath spells and the Channel Divinity feature.",
          "level": 3
        }
      ],
      "fourthLevel": [
          {
            "name": "Ability Score Improvement",
            "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores by 1. As normal, you can't increase an ability score above 20 using this feature.",
            "level": 4
          }
        ],
      "fifthLevel": [
        {
          "name": "Extra Attack",
          "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.",
          "level": 5
        }
      ],
      "sixthLevel": [
        {
          "name": "Aura of Protection",
          "description": "Starting at 6th level, whenever you or a friendly creature within 10 feet of you must make a saving throw, the creature gains a bonus to the saving throw equal to your Charisma modifier (with a minimum bonus of +1). You must be conscious to grant this bonus. At 18th level, the range of this aura increases to 30 feet.",
          "level": 6
        }
      ],
      "tenthLevel": [
        {
          "name": "Aura of Courage",
          "description": "Starting at 10th level, you and friendly creatures within 10 feet of you can't be frightened while you are conscious. At 18th level, the range of this aura increases to 30 feet.",
          "level": 10
        }
      ],
      "eleventhLevel": [
        {
          "name": "Improved Divine Smite",
          "description": "By 11th level, you are so suffused with righteous might that all your melee weapon strikes carry divine power with them. Whenever you hit a creature with a melee weapon, the creature takes an extra 1d8 radiant damage. If you also use your Divine Smite with an attack, you add this damage to the extra damage of your Divine Smite.",
          "level": 11
        }
      ],
      "fourteenthLevel": [
        {
          "name": "Cleansing Touch",
          "description": "Beginning at 14th level, you can use your action to end one spell on yourself or on one willing creature that you touch. You can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain expended uses when you finish a long rest.",
          "level": 14
        }
      ]
    },
    "hitDice": "",
    "hitPointsFirstLevel": "",
    "proficiencies": {
      "armor": [
        "",
        "",
        ""
      ],
      "weapons": [
        "",
        "",
        ""
      ],
      "tools": [
        "",
        "",
        ""
      ],
      "savingThrows": [
        "",
        "",
        ""
      ],
      "skills": [
        "",
        "",
        ""
      ]
    }
  },
  "Ranger": {
    "equipment": [
      "",
      "",
      ""
    ],
    "features": {
      "firstLevel": [
        {
          "name": "Favored Enemy",
          "description": "Beginning at 1st level, you have a significant experience studying, tracking, hunting, and even talking to a certain type of enemy. (ET AL)",
          "level": 1
        },
        {
          "name": "Natural Explorer",
          "description": "Your are particularly familiar with one type of natural environment and are adept at traveling and surviving in such regions. Choose one type of favored terrain: arctic, coast, desert, forest, grassland, mountain, swamp, or the Underdark. When you make an Intelligence or Wisdom check related to your favored terrain, your proficiency bonus is doubled if you are using a skill you are proficient in. (ET AL)",
          "level": 1
        }
      ],
      "secondLevel": [
        {
          "name": "Fighting Style",
          "description": "At 2nd level, you adopt a particular style of fighting as your specialty. Choose one of the below options. You can't take a fighting style more than once, even if you get to choose it again. (ET AL)",
          "level": 2
        }
      ],
      "thirdLevel": [
        {
          "name": "Primeval Awareness",
          "description": "Beginning at 3rd level, you can use your action and expend one ranger spell slot to focus your awareness on the region around you. For 1 minute per level of the spell slot you expend, you can sense whether the following types of creatures are present within 1 mile of you (or within up to 6 miles if you are in your favored terrain): aberrations, celestials, dragons, elementals, fey, fiends, and undead. This feature doesn't reveal the creatures' location or number.",
          "level": 3
        },
        {
          "name": "Ranger Archetype (Archetype Choice)",
          "description": "At 3rd level, you choose an archetype that you strive to emulate: Hunter or Beast Master, both detailed below. Your choice grants you features at 3rd level and again at 7th, 11th, and 15th level.",
          "level": 3
        }
      ],
      "fourthLevel": [
          {
            "name": "Ability Score Improvement",
            "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores by 1. As normal, you can't increase an ability score above 20 using this feature.",
            "level": 4
          }
        ],
      "fifthLevel": [
        {
          "name": "Extra Attack",
          "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.",
          "level": 5
        }
      ],
      "eigthLevel": [
        {
          "name": "Land's Stride",
          "description": "Starting at 8th level, moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spikes, or a similar hazard. In addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such as those created by the entangle spell.",
          "level": 8
        }
      ],
      "tenthLevel": [
        {
          "name": "Hide in Plain Sight",
          "description": "Starting at 10th level, you can spend 1 minute creating camoflauge for yourself. You must have access to fresh mud, dirt, plants, soot, and other naturally occuring materials with which to make your camoflauge. Once you are camouflauged this way, you can try to hide by pressing yourself up against a solid surface, such as a tree or wall, that is at least as tall and wide as you are. You gain a +10 bonus to Dexterity (Stealth) checks as long as you remain there without moving or taking actions. Once you move or take an action or a reaction, you must camouflauge yourself again to gain this benefit.",
          "level": 10
        }
      ],
      "fourteenthLevel": [
        {
          "name": "Vanish",
          "description": "Starting at 14th, you can use the Hide action as a bonus action. Also, you can't be tracked by nonmagical means, unless you choose to leave a trail.",
          "level": 14
        }
      ],
      "eighteenthLevel": [
        {
          "name": "Feral Senses",
          "description": "At 18th level, you gain preternatureal senses that help you fight creatures you can't see. When you attack a creature you can't see, your inability to see it doesn't impose disadvantage on your attack rolls against it. You are also aware of the location of any invisible creature within 30 feet of you, provided that the creature isn't hidden from you and you aren't blinded or deafened.",
          "level": 18
        }
      ],
      "twentiethLevel": [
        {
          "name": "Foe Slayer",
          "description": "At 20th level, you become an unparalleled hunter of your enemies. Once on each of your turns, you can add your Wisdom modifier to the attack roll or the damage roll of an attack you make against one of your favored enemies. You can use to use this feature before or after the roll, but before any effects of the roll are applied.",
          "level": 20
        }
      ]
    },
    "hitDice": "",
    "hitPointsFirstLevel": "",
    "proficiencies": {
      "armor": [
        "",
        "",
        ""
      ],
      "weapons": [
        "",
        "",
        ""
      ],
      "tools": [
        "",
        "",
        ""
      ],
      "savingThrows": [
        "",
        "",
        ""
      ],
      "skills": [
        "",
        "",
        ""
      ]
    }
  },
  "Rogue": {
    "equipment": [
      "",
      "",
      ""
    ],
    "features": {
      "firstLevel": [
        {
          "name": "Expertise",
          "description": "At 1st level, choose two of your skill proficiencies, or one of your skill proficiencies and your proficiency with thieve's tools. Your proficiency bonus is doubled for any ability checks you make that uses either of the chosen proficiencies. At 6th level, you can choose two more of your proficiencies (in skills or with thieve's tools) to gain this benefit.",
          "level": 1
        },
        {
          "name": "Sneak Attack",
          "description": "Beginning at first level, you know how to stike subtly and exploit a foe's distraction. Once per turn, you can deal an extra 1d6 damage to one creature you hit with an attack if you have advantage on the attack roll. The attack must use a finesse or ranged weapon. You don't need advantage on the attack roll if another enemy of the target is within 5 feet of it, that enemy isn't incapacitated, and you don't have disadvantage on the attack roll. The amount of extra damage increases as you gain levels in this class, as shown in the Sneak Attack column of the Rogue table.",
          "level": 1
        },
        {
          "name": "Thieve's Cant",
          "description": "During your rouge training you learned theive's cant, a secret mix of dialect, jargon, and code that allows you to hide messages in seemingly normal conversation. Only another creature that knows thieve's cant understands such messages. It takes four times longer to convey such a message than it does to speak the idea plainly. In addition, you understand a set of secret signs and symbols used to convey short, simple messages, such as whether an area is dangerous or the territory of a thieve's guild, whether loot is nearby, or whether the people in the area are easy marks or will provide a safe house for thieve's on the run.",
          "level": 1
        }
      ],
      "secondLevel": [
        {
          "name": "Cunning Action",
          "description": "Starting at 2nd level, your quick thinking and agility allow you to move and act quickly. You can take a bonus action on each of your turns in combat. This action can be used only to take the Dash, Disengage, or Hide actions.",
          "level": 2
        }
      ],
      "thirdLevel": [
        {
          "name": "Roguish Archetype (Archetype Choice)",
          "description": "At 3rd level, you choose an archetype that you emulate in the exercise of your rogue abilities: Thief, Assassin, or Arcane Trickster all detailed below. Your archetype choice grants you features at 3rd level and again at 9th, 13th, and 17th level.",
          "level": 3
        }
      ],
      "fourthLevel": [
          {
            "name": "Ability Score Improvement",
            "description": "When you reach 4th level, and again at 8th, 10th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores by 1. As normal, you can't increase an ability score above 20 using this feature.",
            "level": 4
          }
        ],
      "fifthLevel": [
        {
          "name": "Uncanny Dodge",
          "description": "Starting at 5th level, when an attacker that you can see hits you with an attack, you can use your reaction to halve the attack's damage against you.",
          "level": 5
        }
      ],
      "seventhLevel": [
        {
          "name": "Evasion",
          "description": "Beginning at 7th level, you can nimbly dodge out of the way of certain area effects, such as a red dragon's fiery breath or an ice storm spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail.",
          "level": 7
        }
      ],
      "eleventhLevel": [
        {
          "name": "Reliable Talent",
          "description": "By 11th level, you have refined your chosen skills until they approach perfection. Whenever you make an ability check that lets you add your proficiency bonus, you can treat a d20 roll of 9 or lower as a 10.",
          "level": 11
        }
      ],
      "fourteenthLevel": [
        {
          "name": "Blindsense",
          "description": "Starting at 14th level, if you are able to hear, you are aware of the location of any hidden or invisible creature within 10 feet of you.",
          "level": 14
        }
      ],
      "fifteenthLevel": [
        {
          "name": "Slippery Mind",
          "description": "By 15th level, you have aquired greater mental strength. You can proficiency in Wisdom saving throws.",
          "level": 15
        }
      ],
      "eighteenthLevel": [
        {
          "name": "Elusive",
          "description": "Beginning at 18th level, you are so evasive that attackers rarely gain the upper hand against you. No attack roll has advantage against you while you aren't incapacitated.",
          "level": 18
        }
      ],
      "twentiethLevel": [
        {
          "name": "Stroke of Luck",
          "description": "At 20th level, you have an uncanny knack for succeeding when you need to. If your attack misses a target within range, you can turn the miss into a hit. Alternatively, if you fail an ability check, you can treat the d20 roll as a 20. Once you use this feature, you can't use it again until you finish a short or long rest.",
          "level": 20
        }
      ]
    },
    "hitDice": "",
    "hitPointsFirstLevel": "",
    "proficiencies": {
      "armor": [
        "",
        "",
        ""
      ],
      "weapons": [
        "",
        "",
        ""
      ],
      "tools": [
        "",
        "",
        ""
      ],
      "savingThrows": [
        "",
        "",
        ""
      ],
      "skills": [
        "",
        "",
        ""
      ]
    }
  },
  "Sorcerer": {
    "equipment": [
      "",
      "",
      ""
    ],
    "features": {
      "firstLevel": [
        {
          "name": "Sorcerous Origin (Archetype Choice)",
          "description": "Choose a sorcerous origin, which describes the source of your innate magical power: Draconic Bloodline or Wild Magic, both detailed below. Your choice grants you features when you choose it at 1st level and again at 6th, 14th, and 18th level.",
          "level": 1
        }
      ],
      "secondLevel": [
        {
          "name": "Font of Magic",
          "description": "At 2nd level, you tap into a deep wellspring of magic within yourself. This wellspring is represented by sorcery points, which allow you to create a variety of magical effects. (ET AL)",
          "level": 2
        }
      ],
      "thirdLevel": [
        {
          "name": "Metamagic",
          "description": "At 3rd level, you gain the ability to twist your spells to suit your needs. You gain two of the following Metamagic options of your choice. You gain another one at 10th and 17th level. You can only use one Metamagic option on a spell when you cast it, unless otherwise noted.",
          "level": 3
        }
      ],
      "fourthLevel": [
          {
            "name": "Ability Score Improvement",
            "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores by 1. As normal, you can't increase an ability score above 20 using this feature.",
            "level": 4
          }
        ],
      "twentiethLevel": [
        {
          "name": "Sorcerous Restoration",
          "description": "At 20th level, you regain 4 expended sorcery points whenever you finish a short rest.",
          "level": 20
        }
      ]
    },
    "hitDice": "",
    "hitPointsFirstLevel": "",
    "proficiencies": {
      "armor": [
        "",
        "",
        ""
      ],
      "weapons": [
        "",
        "",
        ""
      ],
      "tools": [
        "",
        "",
        ""
      ],
      "savingThrows": [
        "",
        "",
        ""
      ],
      "skills": [
        "",
        "",
        ""
      ]
    }
  },
  "Warlock": {
    "equipment": [
      "",
      "",
      ""
    ],
    "features": {
      "firstLevel": [
        {
          "name": "Otherworldly Patron (Archetype Choice)",
          "description": "At 1st level, you have struck a bargain with an otherworldly being of your choice: the Archfey, the Fiend, or the Great Old One, each of which is detailed below. Your choice grants you features at 1st level and again at 6th, 10th, and 14th level.",
          "level": 1
        }
      ],
      "secondLevel": [
        {
          "name": "Eldritch Invocations",
          "description": "In your study of occult lore, you have unearthed eldritch invocations, fragments of forbidden knowledge that imbue you with an abiding magical ability. At 2nd level, you gain two eldritch invocations of your choice. Your invocation options are detailed below. When you gain certain warlock levels, you gain additional invocations of your choice, as shown in the Invocations Known column of the warlock table. Additionally, when you gain a level in this class, you can choose one of the invocations you know and replace it with another invocation that you could learn at that level. (ET AL)",
          "level": 2
        }
      ],
      "thirdLevel": [
        {
          "name": "Pact Boon",
          "description": "At 3rd level, your otherworldly patron bestows a gift upon you for your loyal service. You gain one of the following features of your choice.",
          "level": 3
        }
      ],
      "fourthLevel": [
        {
          "name": "Ability Score Improvement",
          "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores by 1. As normal, you can't increase an ability score above 20 using this feature.",
          "level": 4
        }
      ],
      "eleventhLevel": [
        {
          "name": "Mystic Arcanum",
          "description": "At 11th level, your patron bestows upon you a magical secret called an arcanum. Choose one 6th-level spell from the warlock spell list as as this arcanum. You can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do this again. At higher levels, you gain more warlock spells of your choice that can be cast in this way: one 7th-level spell at 13th level, one 8th-level spell at 15th level, and one 9th-level spell at 17th level. You regain all uses of your Mystic Arcanum when you finish a long rest.",
          "level": 11
        }
      ],
      "twentiethLevel": [
        {
          "name": "Eldritch Master",
          "description": "At 20th level, you can draw on your inner reserve of mystical powers while entreating yoru patron to regain expended spell slots. You can spend 1 minute entreating your patron for aid to regain all your expected spell slots from the Pact Magic feature. Once you regain spell slots with this feature, you must finish a long rest before you can do so again.",
          "level": 20
        }
      ]
    },
    "hitDice": "",
    "hitPointsFirstLevel": "",
    "proficiencies": {
      "armor": [
        "",
        "",
        ""
      ],
      "weapons": [
        "",
        "",
        ""
      ],
      "tools": [
        "",
        "",
        ""
      ],
      "savingThrows": [
        "",
        "",
        ""
      ],
      "skills": [
        "",
        "",
        ""
      ]
    }
  },
  "Wizard": {
    "equipment": [
      "",
      "",
      ""
    ],
    "features": {
      "firstLevel": [
        {
          "name": "Arcane Recovery",
          "description": "You have learned to regain some of your magical energy by studying your spellbook. Once per day when you finish a short rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your wizard level (rounded up), and none of the slots can be 6th level or higher. For example, if you're a 4th level wizard, you can recover up to two levels worth of spell slots. You can recover either a 2nd-level spell or two 1st-level spell slots.",
          "level": 1
        }
      ],
      "secondLevel": [
        {
          "name": "Arcane Tradition (Archetype Choice)",
          "description": "When you reach 2nd level, choose an arcane tradition, shaping your practice of magic through one of eight schools: Abjuration, Conjuration, Divination, Enchantment, Evocation, Illusion, Necromancy, or Transmutation, all detailed below. Your choice grants you features at 2nd level and again at 6th, 10th, and 14th level.",
          "level": 2
        }
      ],
      "fourthLevel": [
        {
          "name": "Ability Score Improvement",
          "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores by 1. As normal, you can't increase an ability score above 20 using this feature.",
          "level": 4
        }
      ],
      "eighteenthLevel": [
        {
          "name": "Spell Mastery",
          "description": "At 18th level, you have achieved such mastery over certain spells that you can cast them at will. Choose a 1st-level wizard spell and a 2nd-level wizard spell that are in your spellbook. You can cast those spells at their lowest level without expending a spell slot when you have them prepared. If you want to cast either spell at a higher level, you must expend a spell slot as normal. By spending 8 hours in study, you can exchange one or both of the spells you chose for different spells of the same level.",
          "level": 18
        }
      ],
      "twentiethLevel": [
        {
          "name": "Signature Spells",
          "description": "When you reach 20th level, you gain mastery over two powerful spells and can cast them with little effort. Choose two 3rd-level wizard spells in your spellbook. You always have these spells prepared, they don't count against the number of spells you have prepared, and you can cast each of them once at 3rd level without expending a spell slot. When you do so, you can't do so again until you finish a short or long rest. If you want to cast either spell at a higher level, you must expend a spell slot like normal.",
          "level": 20
        }
      ]
    },
    "hitDice": "",
    "hitPointsFirstLevel": "",
    "proficiencies": {
      "armor": [
        "",
        "",
        ""
      ],
      "weapons": [
        "",
        "",
        ""
      ],
      "tools": [
        "",
        "",
        ""
      ],
      "savingThrows": [
        "",
        "",
        ""
      ],
      "skills": [
        "",
        "",
        ""
      ]
    }
  }
}
